In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("income.csv", names=["name","income"], skiprows=[0])
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [3]:
df.income.describe()

count    7.000000e+00
mean     1.433929e+06
std      3.777283e+06
min      4.000000e+03
25%      5.500000e+03
50%      7.000000e+03
75%      7.750000e+03
max      1.000000e+07
Name: income, dtype: float64

In [4]:
df.income.quantile(0)

4000.0

In [5]:
df.income.quantile(0.25,interpolation="lower")

5000

In [6]:
df.income.quantile(0.25)

5500.0

In [63]:
df.income.quantile(0.25,interpolation="higher")

6000

In [7]:
df.income.quantile(0.5,interpolation="higher")

7000

In [8]:
df.income.quantile(0.75)

7750.0

In [9]:
df.income.quantile(1)

10000000.0

In [10]:
percentile_99 = df.income.quantile(0.99)
percentile_99

9400479.999999994

In [11]:
df[df.income>percentile_99]

        name    income
6  Elon Musk  10000000

In [12]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [13]:
df2 = df[df.income<percentile_99]
df2

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [14]:
df['income'][3]=np.NaN

C:\Users\mynud\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\mynud\Anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [15]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [16]:
df.income

0        5000.0
1        6000.0
2        4000.0
3           NaN
4        8000.0
5        7000.0
6    10000000.0
Name: income, dtype: float64

In [17]:
df.income.mean()

1671666.6666666667

In [23]:
df_new = df.fillna(df.income.mean())
df_new

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [24]:
df_new = df.fillna(df.income.median())
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [25]:
df2

    name  income
0    Rob  5000.0
1  Rafiq  6000.0
2   Nina  4000.0
3  Sofia     NaN
4  Mohan  8000.0
5    Tao  7000.0

In [26]:
df2['income'][3]=np.NaN

C:\Users\mynud\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\mynud\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3437: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  exec(code_obj, self.user_global_ns, self.user_ns)

In [27]:
df2

    name  income
0    Rob  5000.0
1  Rafiq  6000.0
2   Nina  4000.0
3  Sofia     NaN
4  Mohan  8000.0
5    Tao  7000.0

In [28]:
df2_new = df2.fillna(df2.income.mean())
df2_new

    name  income
0    Rob  5000.0
1  Rafiq  6000.0
2   Nina  4000.0
3  Sofia  6000.0
4  Mohan  8000.0
5    Tao  7000.0

In [29]:
df2_new = df2.fillna(df2.income.median())
df2_new

    name  income
0    Rob  5000.0
1  Rafiq  6000.0
2   Nina  4000.0
3  Sofia  6000.0
4  Mohan  8000.0
5    Tao  7000.0